shelly-tang/YareLampGo_esp32/led_serial.cpp
uint8_t scaledBrightness(uint8_t level) {
  return (uint8_t)((g_brightness * (uint16_t)level) / 255);
}

uint8_t effectChannel(uint8_t channel) {
  uint32_t scaled = (uint32_t)channel * (uint32_t)g_brightness * (uint32_t)g_effectIntensityPercent;
  return (uint8_t)(scaled / (255UL * 100UL));
}

uint32_t effectColor(bool secondary = false) {
  return color(
      effectChannel(secondary ? g_effectSecondaryRed : g_effectRed),
      effectChannel(secondary ? g_effectSecondaryGreen : g_effectGreen),
      effectChannel(secondary ? g_effectSecondaryBlue : g_effectBlue));
}

void setPhysicalPixel(int pixelIndex, uint32_t pixelColor) {
  if (pixelIndex < 0 || pixelIndex >= LAMPGO_LED_PIXEL_COUNT) return;
  int offset = pixelIndex * 3;
  g_pixels[offset + 0] = (uint8_t)((pixelColor >> 8) & 0xFF);
  g_pixels[offset + 1] = (uint8_t)((pixelColor >> 16) & 0xFF);
  g_pixels[offset + 2] = (uint8_t)(pixelColor & 0xFF);
}

int irregularPixelIndex(int row, int col) {
  if (row < 0 || row >= kIrregularRowCount || col < 0 || col >= kIrregularMaxCols) {
    return -1;
  }
  int rowLength = kIrregularRowLengths[row];
  int leftPad = (kIrregularMaxCols - rowLength) / 2;
  int localCol = col - leftPad;
  if (localCol < 0 || localCol >= rowLength) return -1;
  return kIrregularRowStarts[row] + localCol;
}

void setMatrixPixel(int row, int col, uint32_t pixelColor) {
  int pixelIndex = irregularPixelIndex(row, col);
  if (pixelIndex >= 0) {
    setPhysicalPixel(pixelIndex, pixelColor);
  }
}

void setCombinedPixel(int row, int col, uint32_t pixelColor) {
  if (row < 0 || row >= kPanelRows || col < 0 || col >= kCombinedCols) return;
  setMatrixPixel(kPanelRows - 1 - row, kCombinedCols - 1 - col, pixelColor);
}

void fillLogicalCell(int row, int col, uint32_t pixelColor) {
  int row0 = row * kPanelRows / kPatternRows;
  int row1 = ((row + 1) * kPanelRows + kPatternRows - 1) / kPatternRows;
  int col0 = col * kCombinedCols / kPatternCols;
  int col1 = ((col + 1) * kCombinedCols + kPatternCols - 1) / kPatternCols;
  if (row1 <= row0) row1 = row0 + 1;
  if (col1 <= col0) col1 = col0 + 1;
  for (int targetRow = row0; targetRow < row1; ++targetRow) {
    for (int targetCol = col0; targetCol < col1; ++targetCol) {
      setCombinedPixel(targetRow, targetCol, pixelColor);
    }
  }
}

void drawBitmap8OnMatrix(const uint8_t bitmap[8][8], uint32_t pixelColor, int colOffset, int rowOffset = 0) {
  for (int row = 0; row < 8; ++row) {
    int shiftedRow = row + rowOffset;
    if (shiftedRow < 0 || shiftedRow >= 8) continue;
    for (int col = 0; col < 8; ++col) {
      if (bitmap[row][col] == 1) {
        fillLogicalCell(shiftedRow, col + colOffset, pixelColor);
      }
    }
  }
}

void drawBitmap8PairCell(const uint8_t bitmap[8][8], uint32_t pixelColor, int cellOffset, int rowOffset = 0) {
  for (int row = 0; row < 8; ++row) {
    int shiftedRow = row + rowOffset;
    if (shiftedRow < 0 || shiftedRow >= 8) continue;
    for (int col = 0; col < 8; ++col) {
      if (bitmap[row][col] == 1) {
        int mappedCol = (col * 6) / 8;
        fillLogicalCell(shiftedRow, mappedCol + cellOffset, pixelColor);
      }
    }
  }
}

void clearPixels() {
  memset(g_pixels, 0, sizeof(g_pixels));
}

void releaseClipLocked() {
  LedClipPlayer::close();
  g_clipActive = false;
  g_storedClipActive = false;
  g_clipId[0] = 0;
  g_clipFrameCount = 0;
  g_clipFps = 0;
  g_clipFrame = 0;
  g_clipLastFrameMs = 0;
  g_effectTemplate[0] = 0;
  g_effectVariant[0] = 0;
  snprintf(g_effectDirection, sizeof(g_effectDirection), "right");
  g_expressionLoop = true;
  g_expressionEndMs = 0;
}

bool showPixelsLocked();
void renderRingFill(uint32_t pixelColor, uint32_t frame);
void drawBitmap8Pair(const uint8_t bitmap[8][8], uint32_t pixelColor, int rowOffset = 0);
void drawCombinedPattern(int patternIndex, uint32_t primaryColor, uint32_t secondaryColor = 0);

void drawDizzyMouthLocked(uint32_t frameIndex) {
  int phase = (int)(frameIndex % 30);
  int wave = phase <= 15 ? phase : 30 - phase;
  int cx = 25 + ((phase % 6) < 3 ? -1 : 1);
  int cy = 4;
  int halfW = 12 + (wave * 13) / 15;
  int halfH = 2 + (wave * 3) / 15;
  bool customMouth = strcmp(g_effectTemplate, "mouth") == 0;
  uint32_t white = customMouth ? effectColor(false) : color(g_brightness, g_brightness, g_brightness);
  uint32_t cyan = color(0, scaledBrightness(210), g_brightness);
  uint32_t blue = color(0, scaledBrightness(95), g_brightness);
  uint32_t pink = customMouth ? effectColor(true) : color(g_brightness, scaledBrightness(45), scaledBrightness(125));
  uint32_t deep = color(scaledBrightness(105), 0, scaledBrightness(45));
  uint32_t yellow = color(g_brightness, scaledBrightness(210), 0);

  int innerW = halfW > 4 ? halfW - 3 : halfW;
  int innerH = halfH > 2 ? halfH - 1 : halfH;
  for (int row = 0; row < kPanelRows; ++row) {
    for (int col = 0; col < kCombinedCols; ++col) {
      int dx = col - cx;
      int dy = row - cy;
      int outer = (dx * dx * 100) / (halfW * halfW) + (dy * dy * 100) / (halfH * halfH);
      int inner = (dx * dx * 100) / (innerW * innerW) + (dy * dy * 100) / (innerH * innerH);
      if (outer <= 112 && inner >= 58) {
        setCombinedPixel(row, col, row > cy + 1 ? pink : white);
      } else if (outer <= 50 && wave > 6 && row >= cy) {
        setCombinedPixel(row, col, ((col + phase) % 2) ? deep : pink);
      }
    }
  }

  int left = cx - halfW;
  int right = cx + halfW;
  for (int i = 0; i < 4; ++i) {
    uint32_t accent = (i % 2) ? cyan : blue;
    setCombinedPixel(3 + (i % 2), left - 2 + i, accent);
    setCombinedPixel(5 - (i % 2), right + 2 - i, accent);
  }
  if (wave > 5) {
    setCombinedPixel(1, left - 4, yellow);
    setCombinedPixel(2, left - 5, yellow);
    setCombinedPixel(6, right + 4, yellow);
    setCombinedPixel(7, right + 5, yellow);
  }
}

void drawGenericClipMarkerLocked(uint32_t frameIndex) {
  int phase = (int)(frameIndex % 30);
  int wave = phase <= 15 ? phase : 30 - phase;
  int halfW = 10 + (wave * 10) / 15;
  uint32_t white = color(g_brightness, g_brightness, g_brightness);
  uint32_t cyan = color(0, scaledBrightness(180), g_brightness);
  for (int col = 25 - halfW; col <= 25 + halfW; ++col) {
    setCombinedPixel(4, col, white);
    if (wave > 7) {
      setCombinedPixel(3, col, cyan);
      setCombinedPixel(5, col, cyan);
    }
  }
}

uint32_t dimColor(uint32_t pixelColor, uint8_t percent) {
  uint8_t red = (uint8_t)((pixelColor >> 16) & 0xFF);
  uint8_t green = (uint8_t)((pixelColor >> 8) & 0xFF);
  uint8_t blue = (uint8_t)(pixelColor & 0xFF);
  return color(
      (uint8_t)((red * (uint16_t)percent) / 100),
      (uint8_t)((green * (uint16_t)percent) / 100),
      (uint8_t)((blue * (uint16_t)percent) / 100));
}

void drawCodexWordLocked(uint32_t frameIndex) {
  clearPixels();

