shelly-tang/YareLampGo_esp32/led_serial.cpp
  // Two deliberate black gaps make the whole word visibly blink. The short
  // dim phase and cyan scan row give it a compact terminal/glitch character.
  uint8_t phase = (uint8_t)(frameIndex % 20);
  bool visible = phase < 6 || (phase >= 9 && phase < 16) || phase >= 18;
  if (!visible) return;

  uint8_t level = phase == 18 ? 35 : 100;
  uint32_t primary = dimColor(effectColor(false), level);
  uint32_t secondary = dimColor(effectColor(true), level);
  int scanRow = (int)(frameIndex % 7);
  constexpr int kStartCol = 7;
  constexpr int kGlyphWidth = 5;
  constexpr int kGlyphGap = 3;

  for (int glyph = 0; glyph < 5; ++glyph) {
    int glyphCol = kStartCol + glyph * (kGlyphWidth + kGlyphGap);
    for (int row = 0; row < 7; ++row) {
      uint8_t bits = kCodexGlyphRows[glyph][row];
      for (int col = 0; col < kGlyphWidth; ++col) {
        if (bits & (1U << (kGlyphWidth - 1 - col))) {
          setCombinedPixel(row + 1, glyphCol + col, row == scanRow ? secondary : primary);
        }
      }
    }
  }

  // A blinking cursor completes the command-line/Codex visual language.
  if ((phase % 10) < 5) {
    for (int row = 2; row <= 7; ++row) setCombinedPixel(row, 47, secondary);
  }
}

void renderStoredClipFrameLocked(uint32_t frameIndex) {
  clearPixels();
  if (!LedClipPlayer::readTick((uint8_t)(frameIndex % LedClipPlayer::kTickCount),
                               g_storedPackedFrame,
                               sizeof(g_storedPackedFrame))) {
    Serial.printf("[led_matrix] stored frame read failed: %s\n", LedClipPlayer::lastError());
    return;
  }

  uint32_t channelSum = 0;
  for (uint16_t pixel = 0; pixel < LedClipPlayer::kPixelCount; ++pixel) {
    uint8_t paletteIndex = LedClipPlayer::paletteIndexAt(g_storedPackedFrame, pixel);
    uint32_t raw = LedClipPlayer::paletteColor(paletteIndex);
    uint8_t red = (uint8_t)((raw >> 16) & 0xFF);
    uint8_t green = (uint8_t)((raw >> 8) & 0xFF);
    uint8_t blue = (uint8_t)(raw & 0xFF);
    red = (uint8_t)(((uint32_t)red * g_brightness * g_effectIntensityPercent) / (255UL * 100UL));
    green = (uint8_t)(((uint32_t)green * g_brightness * g_effectIntensityPercent) / (255UL * 100UL));
    blue = (uint8_t)(((uint32_t)blue * g_brightness * g_effectIntensityPercent) / (255UL * 100UL));
    channelSum += red + green + blue;
    setPhysicalPixel(pixel, color(red, green, blue));
  }
  if (channelSum > LAMPGO_LED_MAX_CHANNEL_SUM) {
    for (uint16_t pixel = 0; pixel < LedClipPlayer::kPixelCount; ++pixel) {
      int offset = pixel * 3;
      g_pixels[offset + 0] = (uint8_t)(((uint32_t)g_pixels[offset + 0] * LAMPGO_LED_MAX_CHANNEL_SUM) / channelSum);
      g_pixels[offset + 1] = (uint8_t)(((uint32_t)g_pixels[offset + 1] * LAMPGO_LED_MAX_CHANNEL_SUM) / channelSum);
      g_pixels[offset + 2] = (uint8_t)(((uint32_t)g_pixels[offset + 2] * LAMPGO_LED_MAX_CHANNEL_SUM) / channelSum);
    }
  }
  showPixelsLocked();
}

void renderClipFrameLocked(uint32_t frameIndex) {
  if (!g_clipActive || g_clipFrameCount == 0) return;
  if (g_storedClipActive) {
    renderStoredClipFrameLocked(frameIndex);
    return;
  }
  clearPixels();
  if (strcmp(g_effectTemplate, "codex") == 0) {
    drawCodexWordLocked(frameIndex);
    showPixelsLocked();
    return;
  }
  if (strcmp(g_effectTemplate, "mouth") == 0) {
    if (strcmp(g_effectVariant, "flat") == 0) {
      for (int col = 10; col <= 40; ++col) setCombinedPixel(4, col, effectColor(false));
    } else if (strcmp(g_effectVariant, "smile") == 0) {
      for (int col = 12; col <= 38; ++col) {
        int distance = abs(col - 25);
        int row = 3 + (distance * distance) / 190;
        setCombinedPixel(row, col, effectColor(false));
      }
    } else if (strcmp(g_effectVariant, "dizzy") == 0) {
      drawDizzyMouthLocked(frameIndex);
    } else {
      int pulse = 2 + (int)(frameIndex % 10 < 5 ? frameIndex % 5 : 9 - frameIndex % 10);
      int halfW = 17 + pulse;
      int halfH = 3 + pulse / 2;
      for (int row = 0; row < kPanelRows; ++row) {
        for (int col = 0; col < kCombinedCols; ++col) {
          int dx = col - 25;
          int dy = row - 4;
          int outer = (dx * dx * 100) / (halfW * halfW) + (dy * dy * 100) / (halfH * halfH);
          if (outer >= 48 && outer <= 115) setCombinedPixel(row, col, effectColor(false));
        }
      }
    }
    showPixelsLocked();
    return;
  }
  if (strcmp(g_effectTemplate, "arrow") == 0) {
    int pattern = 11;
    if (strcmp(g_effectDirection, "left") == 0) pattern = 10;
    else if (strcmp(g_effectDirection, "up") == 0) pattern = 12;
    else if (strcmp(g_effectDirection, "down") == 0) pattern = 13;
    drawCombinedPattern(pattern, effectColor(false));
    showPixelsLocked();
    return;
  }
  if (strcmp(g_effectTemplate, "heart") == 0) {
    uint8_t pulse = (frameIndex % 10) < 5 ? 100 : 65;
    uint8_t previousIntensity = g_effectIntensityPercent;
    g_effectIntensityPercent = (uint8_t)((previousIntensity * pulse) / 100);
    drawBitmap8Pair(kHeartPattern, effectColor(false));
    g_effectIntensityPercent = previousIntensity;
    showPixelsLocked();
    return;
  }
  if (strcmp(g_effectTemplate, "pulse") == 0) {
    renderRingFill(effectColor(false), frameIndex);
    showPixelsLocked();
    return;
  }
  char key[32];
  normalizeKey(g_clipId, key, sizeof(key));
  if (strcmp(key, "dizzy") == 0) {
    drawDizzyMouthLocked(frameIndex);
  } else {
    drawGenericClipMarkerLocked(frameIndex);
  }
  showPixelsLocked();
}

uint32_t hsvColor(uint16_t hue, uint8_t sat, uint8_t val) {
  uint8_t region = hue / 10923;
  uint16_t remainder = (hue - (region * 10923)) * 6;
  uint8_t p = (uint8_t)(((uint16_t)val * (255 - sat)) / 255);
  uint8_t q = (uint8_t)(((uint16_t)val * (255 - (((uint16_t)sat * remainder) / 65535))) / 255);
  uint8_t t = (uint8_t)(((uint16_t)val * (255 - (((uint16_t)sat * (65535 - remainder)) / 65535))) / 255);

  switch (region) {
    case 0: return color(val, t, p);
    case 1: return color(q, val, p);
    case 2: return color(p, val, t);
    case 3: return color(p, q, val);
    case 4: return color(t, p, val);
    default: return color(val, p, q);
  }
}

