shelly-tang/YareLampGo_esp32/led_serial.cpp
bool ensureRmtLocked() {
  if (!g_rmtData) {
    size_t symbols = LAMPGO_LED_PIXEL_COUNT * 24;
    g_rmtData = (rmt_data_t *)heap_caps_malloc(symbols * sizeof(rmt_data_t),
                                               MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM);
    if (!g_rmtData) {
      g_rmtData = (rmt_data_t *)heap_caps_malloc(symbols * sizeof(rmt_data_t), MALLOC_CAP_8BIT);
    }
    if (!g_rmtData) {
      Serial.printf("[led_matrix] rmt buffer allocation failed: symbols=%u bytes=%u\n",
                    (unsigned)symbols,
                    (unsigned)(symbols * sizeof(rmt_data_t)));
      return false;
    }
  }

  if (!g_rmtReady) {
    g_rmtReady = rmtInit(LAMPGO_LED_PIXEL_PIN, RMT_TX_MODE, RMT_MEM_NUM_BLOCKS_1, 10000000);
    if (!g_rmtReady) {
      Serial.printf("[led_matrix] rmtInit failed on pin=%d\n", (int)LAMPGO_LED_PIXEL_PIN);
      return false;
    }
  }
  return true;
}

bool showPixelsLocked() {
  if (!ensureRmtLocked()) {
    g_lastShowOk = false;
    return false;
  }

  size_t symbol = 0;
  for (size_t byteIndex = 0; byteIndex < sizeof(g_pixels); ++byteIndex) {
    uint8_t value = g_pixels[byteIndex];
    for (int bit = 7; bit >= 0; --bit) {
      bool one = (value & (1 << bit)) != 0;
      g_rmtData[symbol].level0 = 1;
      g_rmtData[symbol].duration0 = one ? 8 : 4;
      g_rmtData[symbol].level1 = 0;
      g_rmtData[symbol].duration1 = one ? 4 : 8;
      symbol++;
    }
  }

  g_lastShowOk = rmtWrite(LAMPGO_LED_PIXEL_PIN, g_rmtData, symbol, 50);
  if (!g_lastShowOk) {
    Serial.printf("[led_matrix] rmtWrite timeout pin=%d symbols=%u\n",
                  (int)LAMPGO_LED_PIXEL_PIN,
                  (unsigned)symbol);
    return false;
  }
  g_lastWriteMs = millis();
  return true;
}

void drawBitmap8(const uint8_t bitmap[8][8], uint32_t pixelColor, int rowOffset = 0) {
  drawBitmap8OnMatrix(bitmap, pixelColor, 4, rowOffset);
}

void drawBitmap8Pair(const uint8_t bitmap[8][8], uint32_t pixelColor, int rowOffset) {
  drawBitmap8PairCell(bitmap, pixelColor, 1, rowOffset);
  drawBitmap8PairCell(bitmap, pixelColor, 9, rowOffset);
}

void drawBitmap8PairWithBottomDots(const uint8_t bitmap[8][8], uint32_t pixelColor) {
  drawBitmap8Pair(bitmap, pixelColor);
  fillLogicalCell(6, 3, pixelColor);
  fillLogicalCell(7, 3, pixelColor);
  fillLogicalCell(6, 4, pixelColor);
  fillLogicalCell(7, 4, pixelColor);
  fillLogicalCell(6, 11, pixelColor);
  fillLogicalCell(7, 11, pixelColor);
  fillLogicalCell(6, 12, pixelColor);
  fillLogicalCell(7, 12, pixelColor);
}

void drawCombinedPattern(int patternIndex, uint32_t primaryColor, uint32_t secondaryColor) {
  clearPixels();
  if (patternIndex < 0 ||
      patternIndex >= (int)(sizeof(kCombinedPatterns) / sizeof(kCombinedPatterns[0]))) {
    return;
  }
  for (int row = 0; row < kPatternRows; ++row) {
    for (int col = 0; col < kPatternCols; ++col) {
      uint8_t value = kCombinedPatterns[patternIndex][row][col];
      if (value == 0) continue;
      fillLogicalCell(row, col, value == 2 ? secondaryColor : primaryColor);
    }
  }
}

void renderRingFill(uint32_t pixelColor, uint32_t frame) {
  clearPixels();
  int maxRing = (int)(frame > 4 ? 4 : frame);
  for (int row = 0; row < kPanelRows; ++row) {
    for (int col = 0; col < kCombinedCols; ++col) {
      int ring = min(min(row, kPanelRows - 1 - row), min(col, kCombinedCols - 1 - col));
      if (ring <= maxRing) {
        setCombinedPixel(row, col, pixelColor);
      }
    }
  }
}

void renderTheater(uint32_t pixelColor, uint32_t frame) {
  clearPixels();
  int start = (int)(frame % 3);
  for (int index = start; index < LAMPGO_LED_PIXEL_COUNT; index += 3) {
    setPhysicalPixel(index, pixelColor);
  }
}

void renderRainbow(uint32_t frame) {
  clearPixels();
  uint16_t firstHue = (uint16_t)((frame * 256U) & 0xFFFF);
  for (int index = 0; index < LAMPGO_LED_PIXEL_COUNT; ++index) {
    uint16_t hue = firstHue + (uint32_t)index * 65536UL / LAMPGO_LED_PIXEL_COUNT;
    setPhysicalPixel(index, hsvColor(hue, 255, g_brightness));
  }
}

void renderRainbowChase(uint32_t frame) {
  clearPixels();
  int start = (int)(frame % 3);
  uint16_t firstHue = (uint16_t)(((frame * (65536U / 90U))) & 0xFFFF);
  for (int index = start; index < LAMPGO_LED_PIXEL_COUNT; index += 3) {
    uint16_t hue = firstHue + (uint32_t)index * 65536UL / LAMPGO_LED_PIXEL_COUNT;
    setPhysicalPixel(index, hsvColor(hue, 255, g_brightness));
  }
}

void renderMusic(uint32_t frame) {
  static const int8_t offsets[] = {0, -1, -2, -1, 0, 1, 0};
  const uint32_t colors[] = {
      color(g_brightness, 0, g_brightness),
      color(0, g_brightness, g_brightness),
      color(g_brightness, g_brightness, 0),
      color(g_brightness, 0, 0),
  };

  clearPixels();
  drawBitmap8Pair(kMusicNote, colors[(frame / 7) % 4], offsets[frame % 7]);
}

void renderThinking(uint32_t frame) {
  clearPixels();
  uint8_t low = g_brightness / 10;
  drawBitmap8Pair(kCirclePattern, color(low, low, low));

  static const uint8_t path[20][2] = {
      {0,2},{0,3},{0,4},{0,5},{1,6},{2,7},{3,7},{4,7},{5,7},{6,6},
      {7,5},{7,4},{7,3},{7,2},{6,1},{5,0},{4,0},{3,0},{2,0},{1,1},
  };

  const uint8_t *point = path[frame % 20];
  fillLogicalCell(point[0], (point[1] * 6) / 8 + 1, color(g_brightness, g_brightness, g_brightness));
  fillLogicalCell(point[0], (point[1] * 6) / 8 + 9, color(g_brightness, g_brightness, g_brightness));
}

void renderHeart(uint32_t frame) {
  static const uint8_t levels[] = {255, 128, 77, 128, 255};
  clearPixels();
  drawBitmap8(kHeartPattern, color(scaledBrightness(levels[frame % 5]), 0, 0));
}

void renderSurprised(uint32_t frame) {
  uint32_t phase = frame % 12;
  int patternIndex = phase == 0 ? 19 : (phase == 1 ? 20 : 21);
  drawCombinedPattern(patternIndex, color(0, g_brightness, g_brightness));
}

void renderSleep(uint32_t frame) {
  uint32_t pixelColor = color(g_brightness / 2, g_brightness / 2, g_brightness);
  drawCombinedPattern(frame % 2 == 0 ? 17 : 18, pixelColor);
}

void renderHelpless(uint32_t frame) {
  uint32_t faceColor = color(0, g_brightness, g_brightness);
  uint32_t sweatColor = color(0, g_brightness / 2, g_brightness);
  drawCombinedPattern((frame % 8) < 5 ? 4 : 5, faceColor, sweatColor);
}

